'''Профиль пользователя

Условие:
Создайте заготовку для профиля пользователя.

Вам нужно:

    Определить класс UserProfile.

    Создать в нем два метода:

        show_profile() должен возвращать строку "Это профиль пользователя."

        edit_profile() должен возвращать строку "Редактирование профиля."

Sample Input:

Sample Output:

Это профиль пользователя.
Редактирование профиля.

'''

class UserProfile:
    def show_profile(self):
        return 'Это профиль пользователя.'

    def edit_profile(self):
        return 'Редактирование профиля.'